import React from 'react';
import '../styles/AboutAuthors.css';

const AboutFranko = () => {
  return (
    <>
      <div className="author-container">
        <h1>Іван Франко</h1>
        <div style={{ width: '80%', height: '5px', backgroundColor: '#2b3538', marginLeft: '0px'}}></div>
        <div className="author-content">
          <img
            src="https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/%D0%86%D0%B2%D0%B0%D0%BD_%D0%AF%D0%BA%D0%BE%D0%B2%D0%B8%D1%87_%D0%A4%D1%80%D0%B0%D0%BD%D0%BA%D0%BE.jpg/250px-%D0%86%D0%B2%D0%B0%D0%BD_%D0%AF%D0%BA%D0%BE%D0%B2%D0%B8%D1%87_%D0%A4%D1%80%D0%B0%D0%BD%D0%BA%D0%BE.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
          <div className="author-text">
            <p>
            <b>Іван Якович Франко (1856–1916)</b> — один із найвідоміших українських письменників, поетів, публіцистів, філософів, вчених і політичних діячів. Франко народився <b>27 серпня 1856 року</b> в селі Нагуєвичі (тепер Львівська область) в родині селян. Він був багатогранною особистістю, яка зробила величезний внесок у розвиток української культури та літератури. Франко отримав гарну освіту, навчався в університетах <b>Львова та Відня</b>, де вивчав <b>філософію, філологію, історію та економіку</b>. Його інтелектуальні погляди значно вплинули на розвиток української національної думки.

Франко був одним із засновників <b>нової української літератури</b> та одним із найвідоміших представників літературного руху, який постав наприкінці XIX століття.
            </p>
          </div>
        </div>
        <div className="author-text2">
          <p>
          Він писав у різних жанрах: <b>поезії, прозі, драматургії, публіцистиці</b>. Його твори, зокрема поеми <b>"Іван Вишенський", "Мойсей", роман "Борислав сміється"</b> та численні статті, порушують важливі соціальні, національні та політичні питання. Франко зображував <b>боротьбу за права людини, соціальну справедливість, національне відродження та демократичні цінності</b>. Він був одним з перших, хто активно підтримував ідеї соціалізму, але з часом виявив критичне ставлення до радикальних форм цього руху.
          </p>


        </div>

        <div className="author-content">
        <div className="author-text">
            <p>
            Окрім літературної діяльності, Франко був і <b>активним громадським діячем, політиком і публіцистом</b>. Він активно виступав за розвиток української культури, за права українців в <b>Австро-Угорщині</b>, за освіту й розвиток національної свідомості. Франко був обраний депутатом до австрійського парламенту, де відстоював інтереси українців. Його життя було складним, сповненим боротьбою за ідеали та принципи, він часто стикався з переслідуваннями й <b>репресіями</b> з боку влади. Іван Франко помер <b>28 травня 1916 року</b> у Львові. Його творчість і діяльність залишили незгладимий слід в історії України, і він є одним із символів української національної ідентичності.
            </p>
          </div>
          <img
            src="https://www.ukrlib.com.ua/my/images/full/franko-ivan-iakovych_1.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
        </div>
        <div className="author-actions">
          <p className="action-text1">Виконати тест</p>
          <p className="action-text2">Почути голос письменника</p>
          <p className="action-text3">Цікаві факти</p>
        </div>

      </div>
      </>
  );
};

export default AboutFranko;
