import React from 'react';
import '../styles/AboutAuthors.css';

const AboutAuthors = () => {
  return (
    <>
      <div className="author-container">
        <h1>Тарас Шевченко</h1>
        <div className="author-content">
          <img
            src="https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Taras_Shevchenko_selfportrait_oil_1840-2.jpg/248px-Taras_Shevchenko_selfportrait_oil_1840-2.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
          <div className="author-text">
            <p>
            Тарас Григорович Шевченко народився 9 березня 1814 року в селі Моринці на Черкащині в родині кріпаків. Його дитинство було важким, оскільки він рано втратив батьків і потрапив у неволю до поміщика. Мати померла, коли Тарасу було лише 9 років, і він разом з братом залишився під опікою батька, а згодом — під контролем кріпосного права. Виявивши талант до малювання, він почав навчатися у місцевих художників. Коли Шевченка помітив один із петербурзьких художників, він порадив викупити його. У 1831 році, завдяки підтримці відомого художника Карла Брюллова, Шевченка викупили з кріпацтва, і він вирушив до Петербурга, де його життя змінилося.

          В Петербурзі Шевченко став студентом Академії мистецтв, а також розпочав активно писати. З 1840 року вийшла його перша збірка поезій, "Кобзар", яка принесла йому популярність і визнання. 
            </p>
          </div>
        </div>
        <div className="author-text2">
          <p>
          Проте його життя було омрачене численними переслідуваннями. У 1847 році, за участь у Кирило-Мефодіївському братстві, Шевченко був арештований і засланий до Орської фортеці. Його піддали суворому режиму: він не мав права писати, малювати та спілкуватися з іншими людьми. Однак навіть у цих умовах він не переставав думати про свою батьківщину і прагнув передати українцям ідею національного відродження. Після 10 років заслання, у 1857 році, Шевченко повернувся до Петербурга, але його здоров'я було зруйноване важкими умовами життя.
          </p>
        </div>
        <div className="author-content">
        <div className="author-text">
            <p>
            В останні роки свого життя Шевченко продовжував творити, проте він вже не зміг повернутися до рідної України. Він створив значну кількість поезій, де висвітлював важливі для нього теми — боротьбу за волю, соціальну рівність і справедливість. 10 березня 1861 року, через кілька днів після свого 47-річчя, Тарас Шевченко помер у Петербурзі від хвороби. Його поховали на Волковому цвинтарі, але за заповітом прах Шевченка перевезли до України, де його перепоховали на Чернечій горі в Каневі. Творчість Шевченка стала основою для формування української національної ідентичності, і він по праву вважається символом боротьби за права українців і національну незалежність.
            </p>
          </div>
          <img
            src="https://www.writers.in.ua/wp-content/uploads/2019/02/taras-shevchenko.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
        </div>

        <div className="author-actions">
          <p className="action-text1">Виконати тест</p>
          <p className="action-text2">Почути голос письменника</p>
          <p className="action-text3">Цікаві факти</p>
        </div>
      </div>

      {/* Author 2 */}
      <div className="author-container">
        <h1>Леся Українка</h1>
        <div className="author-content">
          
          <div className="author-text">
            <p>
            Леся Українка (справжнє ім'я — Лариса Петрівна Косач) народилася 25 лютого 1871 року в Новограді-Волинському (тепер Житомирська область). Вона була однією з найвизначніших постатей української літератури та культури, поетесою, драматургом, публіцистом і активісткою національного руху. В родині інтелігентів вона змалку отримала гарну освіту: знала кілька іноземних мов і відвідувала літературні та театральні гуртки. Літературний псевдонім "Леся Українка" вона обрала, аби підкреслити свою приналежність до українського народу та підтримати національну ідентичність.

З дитинства Леся страждала від важкої хвороби — туберкульозу кісток, який супроводжував її усе життя, однак вона не дозволяла хворобі обмежувати її творчі можливості. 
            </p>
          </div>
          <img
            src="https://onlyart.org.ua/wp-content/uploads/2022/12/Lesya-Ukrainka-1024x1024.jpg" // Replace with actual image
            alt="Lesya Ukrainka"
            className="author-photo"
          />
        </div>
        <div className="author-text2">
          <p>
          Вже у молодому віці вона почала писати вірші, і в 13 років її перша публікація з’явилася у журналі "Зоря". Перші твори поетеси мали яскраво виражений фольклорний характер, а згодом її стиль еволюціонував, стаючи більш глибоким і філософським. Леся Українка писала не лише поезії, а й драматичні твори, зокрема трагедії, що стали класикою української літератури. Серед найвідоміших — "Лісова пісня" та "Кассандра".
          </p>
        </div>
        <div className="author-content">
        <img
            src="https://www.ranok.com.ua/storage/img/author/84a250baa9514e83.jpg" // Replace with actual image
            alt="Lesya Ukrainka"
            className="author-photo"
          />
        <div className="author-text">
  
            <p>
            Активно залучена до громадсько-політичного життя, Леся Українка була однією з провідних постатей українського національного руху кінця XIX — початку XX століття. Вона підтримувала боротьбу за незалежність України, займалася педагогічною діяльністю, активно писала статті й публіцистичні твори. Вона багато подорожувала, проживала в різних країнах Європи, де знаходила підтримку серед культурної еліти. Леся Українка померла 1 серпня 1913 року в місті Сурамі (Грузія), залишивши по собі величезну спадщину. Її твори стали основою для розвитку сучасної української літератури та надихають наступні покоління.
            </p>
          </div>
        </div>
        <div className="author-actions">
          <p className="action-text1">Виконати тест</p>
          <p className="action-text2">Почути голос письменниці</p>
          <p className="action-text3">Цікаві факти</p>
        </div>
      </div>

      {/* Author 3 */}
      <div className="author-container">
        <h1>Іван Франко</h1>
        <div className="author-content">
          <img
            src="https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/%D0%86%D0%B2%D0%B0%D0%BD_%D0%AF%D0%BA%D0%BE%D0%B2%D0%B8%D1%87_%D0%A4%D1%80%D0%B0%D0%BD%D0%BA%D0%BE.jpg/250px-%D0%86%D0%B2%D0%B0%D0%BD_%D0%AF%D0%BA%D0%BE%D0%B2%D0%B8%D1%87_%D0%A4%D1%80%D0%B0%D0%BD%D0%BA%D0%BE.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
          <div className="author-text">
            <p>
            Іван Якович Франко (1856–1916) — один із найвідоміших українських письменників, поетів, публіцистів, філософів, вчених і політичних діячів. Франко народився 27 серпня 1856 року в селі Нагуєвичі (тепер Львівська область) в родині селян. Він був багатогранною особистістю, яка зробила величезний внесок у розвиток української культури та літератури. Франко отримав гарну освіту, навчався в університетах Львова та Відня, де вивчав філософію, філологію, історію та економіку. Його інтелектуальні погляди значно вплинули на розвиток української національної думки.

Франко був одним із засновників нової української літератури та одним із найвідоміших представників літературного руху, який постав наприкінці XIX століття.
            </p>
          </div>
        </div>
        <div className="author-text2">
          <p>
          Він писав у різних жанрах: поезії, прозі, драматургії, публіцистиці. Його твори, зокрема поеми "Іван Вишенський", "Мойсей", роман "Борислав сміється" та численні статті, порушують важливі соціальні, національні та політичні питання. Франко зображував боротьбу за права людини, соціальну справедливість, національне відродження та демократичні цінності. Він був одним з перших, хто активно підтримував ідеї соціалізму, але з часом виявив критичне ставлення до радикальних форм цього руху.
          </p>


        </div>

        <div className="author-content">
        <div className="author-text">
            <p>
            Окрім літературної діяльності, Франко був і активним громадським діячем, політиком і публіцистом. Він активно виступав за розвиток української культури, за права українців в Австро-Угорщині, за освіту й розвиток національної свідомості. Франко був обраний депутатом до австрійського парламенту, де відстоював інтереси українців. Його життя було складним, сповненим боротьбою за ідеали та принципи, він часто стикався з переслідуваннями й репресіями з боку влади. Іван Франко помер 28 травня 1916 року у Львові. Його творчість і діяльність залишили незгладимий слід в історії України, і він є одним із символів української національної ідентичності.
            </p>
          </div>
          <img
            src="https://www.ukrlib.com.ua/my/images/full/franko-ivan-iakovych_1.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
        </div>
        <div className="author-actions">
          <p className="action-text1">Виконати тест</p>
          <p className="action-text2">Почути голос письменника</p>
          <p className="action-text3">Цікаві факти</p>
        </div>
      </div>
    </>
  );
};

export default AboutAuthors;
