import React from 'react';
import '../styles/AboutAuthors.css';

const AboutAuthors = () => {
  return (
    <div className="author-container">
      <h1>Taras</h1>
      <div className="author-content">
        
        <img
          src="https://via.placeholder.com/200" // Replace with actual image
          alt="Taras Shevchenko"
          className="author-photo"
        />
        <div className="author-text">
          <p>
          Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          
          </p>
        </div>
      </div>
      <div className="author-text2">
          <p>
          Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          один з основоположників нової української літератури.Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч,
          
          </p>
        
          </div>
          <div className="author-actions">
            <p className="action-text1">Take test</p> 
            <p className="action-text2">Hear the voice</p>
          </div> 
    </div>
    

    
  );
};

export default AboutAuthors;
