import React from 'react';
import '../styles/AboutAuthors.css';

const AboutStus = () => {
  return (
    <>
      <div className="author-container">
        <h1>Василь Стус</h1>
        <div style={{ width: '80%', height: '5px', backgroundColor: '#37633f', marginLeft: '0px'}}></div>
        <div className="author-content">
          <img
            src="https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcS_sy5K2KmSIeEiDWQZhu0CjvXKMQifSTfpiQ&s" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
          <div className="author-text">
            <p>
            <b>Василь Стус (1938–1985)</b> — видатний український поет, дисидент, публіцист, один із найважливіших представників української літератури XX століття. Народився <b>6 січня 1938 року</b> в селі Рахнівка на Черкащині. З дитинства проявляв високий інтелектуальний потенціал і захоплювався літературою. Після закінчення школи вступив до <b>Київського університету на філологічний факультет</b>, де активно займався літературною діяльністю та входив до студентських літературних гуртків. Проте перші кроки на шляху до літературної кар'єри були важкими: його твори не отримували широкого визнання через політичні обставини того часу.

Стус став відомим як один із головних представників українського "шістдесятництва" — покоління митців, які виступали за свободу творчості і національну самобутність в умовах радянського режиму. 
            </p>
          </div>
        </div>
        <div className="author-text2">
          <p>
          Його поезія відзначалася <b>глибоким патріотизмом, філософськими роздумами про сенс життя і місце людини в світі</b>. У своїх творах він порушував питання гідності, свободи, боротьби за правду в умовах тоталітарного режиму. Стус активно підтримував <b>національний рух</b>, його поезія стала символом боротьби за права людини та протистояння репресивній машині радянської влади.

У 1972 році Стуса було заарештовано за <b>"антирадянську діяльність"</b>. Він був звинувачений у поширенні літератури, що мала "націоналістичний" характер, і за критику радянської влади. Поет був засуджений до десяти років таборів суворого режиму та п'яти років заслання. Тривале перебування в таборах позначилося на його здоров'ї, але навіть у цих умовах Стус продовжував писати вірші, що пізніше стали <b>невід'ємною частиною його творчої спадщини</b>.
          </p>


        </div>

        <div className="author-content">
        <div className="author-text">
            <p>
            У <b>1980 році</b> він був звільнений, але вже через кілька років, 4 вересня 1985 року, Стус помер у колонії для особливо небезпечних злочинців у <b>Пермській області Росії</b>.

Творчість Стуса відзначалася не тільки <b>глибоким змістом</b>, а й майстерним використанням української мови. Його вірші стали символом <b>стійкості, мужності та духовної сили, вони не втратили актуальності й до сьогодні</b>. Поет залишив величезну літературну спадщину, що складається з поезій, есеїв і листів, які служать прикладом боротьби за свободу і права людини. Василь Стус став <b>символом незламної волі та інтелектуального спротиву</b> в умовах жорстокого тоталітарного режиму.
            </p>
          </div>
          <img
            src="https://odnb.odessa.ua/img/novini_2018/1900/1-1.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
        </div>
        <div className="author-actions">
          <p className="action-text1">Виконати тест</p>
          <p className="action-text2">Почути голос письменника</p>
          <p className="action-text3">Цікаві факти</p>
        </div>

      </div>
      </>
  );
};

export default AboutStus;
