import React from 'react';
import '../styles/AboutAuthors.css';

const AboutShevchenko = () => {
  return (
    <>
      <div className="author-container">
        <h1>Тарас Шевченко</h1>
        <div style={{ width: '80%', height: '5px', backgroundColor: '#2b3538', marginLeft: '0px'}}></div>
        <div className="author-content">
          <img
            src="https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Taras_Shevchenko_selfportrait_oil_1840-2.jpg/248px-Taras_Shevchenko_selfportrait_oil_1840-2.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
          <div className="author-text">
            <p>
            <b>Тарас Григорович Шевченко</b> народився 9 березня 1814 року в селі <b>Моринці</b> на Черкащині в родині кріпаків. Його дитинство було важким, оскільки він рано втратив батьків і потрапив у неволю до поміщика. Мати померла, коли Тарасу було лише 9 років, і він разом з братом залишився під опікою батька, а згодом — під контролем кріпосного права. Виявивши талант до малювання, він почав навчатися у місцевих художників. Коли Шевченка помітив один із петербурзьких художників, він порадив викупити його. У <b>1831 році</b>, завдяки підтримці відомого художника <b>Карла Брюллова</b>, Шевченка викупили з кріпацтва, і він вирушив до Петербурга, де його життя змінилося.

          В Петербурзі Шевченко став студентом <b>Академії мистецтв</b>, а також розпочав активно писати. З 1840 року вийшла його перша збірка поезій,<b> "Кобзар"</b>, яка принесла йому популярність і визнання. 
            </p>
          </div>
        </div>
        <div className="author-text2">
          <p>
          Проте його життя було омрачене численними переслідуваннями. У <b>1847 році</b>, за участь у Кирило-Мефодіївському братстві, Шевченко був арештований і засланий до <b>Орської фортеці</b>. Його піддали суворому режиму: він не мав права писати, малювати та спілкуватися з іншими людьми. Однак навіть у цих умовах він не переставав думати про свою батьківщину і прагнув передати українцям ідею національного відродження. Після 10 років заслання, у <b>1857 році</b>, Шевченко повернувся до Петербурга, але його здоров'я було зруйноване важкими умовами життя.
          </p>
        </div>
        <div className="author-content">
        <div className="author-text">
            <p>
            В останні роки свого життя Шевченко продовжував творити, проте він вже не зміг повернутися до рідної України. Він створив значну кількість поезій, де висвітлював важливі для нього теми — боротьбу за волю, соціальну рівність і справедливість. <b>10 березня 1861 року</b>, через кілька днів після свого 47-річчя, Тарас Шевченко помер у Петербурзі від хвороби. Його поховали на Волковому цвинтарі, але за заповітом прах Шевченка перевезли до України, де його перепоховали на Чернечій горі в Каневі. Творчість Шевченка стала основою для формування <b>української національної ідентичності</b>, і він по праву вважається символом боротьби за права українців і національну незалежність.
            </p>
          </div>
          <img
            src="https://www.writers.in.ua/wp-content/uploads/2019/02/taras-shevchenko.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
        </div>

        <div className="author-actions">
          <p className="action-text1">Виконати тест</p>
          <p className="action-text2">Почути голос письменника</p>
          <p className="action-text3">Цікаві факти</p>
        </div>
      </div>

      </>
  );
};

export default AboutShevchenko;
