import React from 'react';
import '../styles/AboutAuthors.css';

const AboutHwylyovyi = () => {
  return (
    <>
      <div className="author-container">
        <h1>Микола Хвильовий</h1>
        <div style={{ width: '80%', height: '5px', backgroundColor: '#2b3538', marginLeft: '0px'}}></div>
        <div className="author-content">
          <img
            src="https://uinp.gov.ua/storage/app/public/uploads/2018-12-20/10/Rqj1545303563ESY.jpeg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
          <div className="author-text">
            <p>
            <b>Микола Хвильовий (справжнє ім'я — Микола Григорович Фітільов)</b> — видатний український письменник, поет, публіцист і критик, один із основоположників модернізму в українській літературі XX століття. Народився <b>13 грудня 1893 року</b> в селі Тростянець на Сумщині в родині священника. Він здобув початкову освіту в церковно-приходській школі, а згодом навчався в Харкові. Під час <b>Першої світової війни</b> Хвильовий служив в армії, а після революційних подій 1917 року активно приєднався до українського культурного і політичного життя.

Микола Хвильовий став однією з <b>ключових фігур української літератури 1920-х років</b>. Він був активно залучений до літературного процесу, ставши головним ідеологом <b>"Розстріляного відродження"</b> — творчого руху, який прагнув створити нову українську літературу, відмовившись від старих форм і підходів.
            </p>
          </div>
        </div>
        <div className="author-text2">
          <p>
          Хвильовий був палким прихильником ідеї національного відродження через <b>культуру</b>, адже він вірив, що література має величезну роль у формуванні національної свідомості. Його твори вирізняються глибоким <b>філософським змістом</b>, а також соціальною критикою та психологізмом. Окрему увагу привертають його поетичні та прозові твори, зокрема повість <b>"Санаторій "Кріденс"</b>і новела <b>"Я (Романтика)"</b>, де він порушував питання національної ідентичності, культурного зростання та боротьби за власне "я".
          </p>


        </div>

        <div className="author-content">
        <div className="author-text">
            <p>
            Хвильовий був однією з фігур, яка стояла на стику між <b>революційними змінами і культурною реакцією</b>, що мала місце у перші роки радянської влади. Він намагався поєднати прагнення до <b>революційних змін</b> із необхідністю збереження національних традицій і самобутності. У своїх публіцистичних статтях, таких як <b>"Україна чи Малоросія?"</b>, він закликав до відновлення української національної ідентичності і підкреслював необхідність культурної автономії для України. Проте його літературна діяльність не оминула переслідувань — у <b>1933 році</b>, через свою політичну діяльність і позиції, Хвильовий був змушений накласти на себе руки. Його смерть стала символом трагедії багатьох українських інтелектуалів того часу, які не змогли знайти місце в умовах репресивної радянської системи. Відтак, <b>Микола Хвильовий</b> залишив величезну спадщину, яка продовжує надихати наступні покоління українських митців і мислителів.
            </p>
          </div>
          <img
            src="https://dovidka.biz.ua/wp-content/uploads/2014/10/Mikola-Hviloviybiografiya-korotka.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
        </div>
        <div className="author-actions">
          <p className="action-text1">Виконати тест</p>
          <p className="action-text2">Почути голос письменника</p>
          <p className="action-text3">Цікаві факти</p>
        </div>

      </div>
      </>
  );
};

export default AboutHwylyovyi;
