import React from 'react';
import '../styles/AboutAuthors.css';

const AboutAuthors = () => {
  return (
    <>
      <div className="author-container">
        <h1>Тарас Шевченко</h1>
        <div style={{ width: '80%', height: '5px', backgroundColor: '#37633f', marginLeft: '0px'}}></div>
        <div className="author-content">
          <img
            src="https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Taras_Shevchenko_selfportrait_oil_1840-2.jpg/248px-Taras_Shevchenko_selfportrait_oil_1840-2.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
          <div className="author-text">
            <p>
            <b>Тарас Григорович Шевченко</b> народився 9 березня 1814 року в селі <b>Моринці</b> на Черкащині в родині кріпаків. Його дитинство було важким, оскільки він рано втратив батьків і потрапив у неволю до поміщика. Мати померла, коли Тарасу було лише 9 років, і він разом з братом залишився під опікою батька, а згодом — під контролем кріпосного права. Виявивши талант до малювання, він почав навчатися у місцевих художників. Коли Шевченка помітив один із петербурзьких художників, він порадив викупити його. У <b>1831 році</b>, завдяки підтримці відомого художника <b>Карла Брюллова</b>, Шевченка викупили з кріпацтва, і він вирушив до Петербурга, де його життя змінилося.

          В Петербурзі Шевченко став студентом <b>Академії мистецтв</b>, а також розпочав активно писати. З 1840 року вийшла його перша збірка поезій,<b> "Кобзар"</b>, яка принесла йому популярність і визнання. 
            </p>
          </div>
        </div>
        <div className="author-text2">
          <p>
          Проте його життя було омрачене численними переслідуваннями. У <b>1847 році</b>, за участь у Кирило-Мефодіївському братстві, Шевченко був арештований і засланий до <b>Орської фортеці</b>. Його піддали суворому режиму: він не мав права писати, малювати та спілкуватися з іншими людьми. Однак навіть у цих умовах він не переставав думати про свою батьківщину і прагнув передати українцям ідею національного відродження. Після 10 років заслання, у <b>1857 році</b>, Шевченко повернувся до Петербурга, але його здоров'я було зруйноване важкими умовами життя.
          </p>
        </div>
        <div className="author-content">
        <div className="author-text">
            <p>
            В останні роки свого життя Шевченко продовжував творити, проте він вже не зміг повернутися до рідної України. Він створив значну кількість поезій, де висвітлював важливі для нього теми — боротьбу за волю, соціальну рівність і справедливість. <b>10 березня 1861 року</b>, через кілька днів після свого 47-річчя, Тарас Шевченко помер у Петербурзі від хвороби. Його поховали на Волковому цвинтарі, але за заповітом прах Шевченка перевезли до України, де його перепоховали на Чернечій горі в Каневі. Творчість Шевченка стала основою для формування <b>української національної ідентичності</b>, і він по праву вважається символом боротьби за права українців і національну незалежність.
            </p>
          </div>
          <img
            src="https://www.writers.in.ua/wp-content/uploads/2019/02/taras-shevchenko.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
        </div>

        <div className="author-actions">
          <p className="action-text1">Виконати тест</p>
          <p className="action-text2">Почути голос письменника</p>
          <p className="action-text3">Цікаві факти</p>
        </div>
      </div>
    
      {/* Author 2 */}
      <div className="author-container">
        <h1>Леся Українка</h1>
        <div style={{ width: '80%', height: '5px', backgroundColor: '#37633f', marginLeft: '20px'}}></div>
        <div className="author-content">
          
          <div className="author-text">
            <p>
            <b>Леся Українка</b> (справжнє ім'я — Лариса Петрівна Косач) народилася <b>25 лютого 1871 року</b> в Новограді-Волинському (тепер Житомирська область). Вона була однією з найвизначніших постатей української літератури та культури, поетесою, драматургом, публіцистом і активісткою національного руху. В родині інтелігентів вона змалку отримала гарну освіту: <b>знала кілька іноземних мов</b> і відвідувала літературні та театральні гуртки. Літературний псевдонім <b>"Леся Українка"</b> вона обрала, аби підкреслити свою приналежність до українського народу та підтримати національну ідентичність.

З дитинства Леся страждала від важкої хвороби — <b>туберкульозу кісток</b>, який супроводжував її усе життя, однак вона не дозволяла хворобі обмежувати її творчі можливості. 
            </p>
          </div>
          <img
            src="https://onlyart.org.ua/wp-content/uploads/2022/12/Lesya-Ukrainka-1024x1024.jpg" // Replace with actual image
            alt="Lesya Ukrainka"
            className="author-photo"
          />
        </div>
        <div className="author-text2">
          <p>
          Вже у молодому віці вона почала писати вірші, і в <b>13 років</b> її перша публікація з’явилася у журналі <b>"Зоря"</b>. Перші твори поетеси мали яскраво виражений фольклорний характер, а згодом її стиль еволюціонував, стаючи більш глибоким і філософським. Леся Українка писала не лише поезії, а й <b>драматичні твори</b>, зокрема трагедії, що стали класикою української літератури. Серед найвідоміших — <b>"Лісова пісня" та "Кассандра"</b>.
          </p>
        </div>
        <div className="author-content">
        <img
            src="https://www.ranok.com.ua/storage/img/author/84a250baa9514e83.jpg" // Replace with actual image
            alt="Lesya Ukrainka"
            className="author-photo"
          />
        <div className="author-text">
  
            <p>
            Активно залучена до <b>громадсько-політичного життя</b>, Леся Українка була однією з провідних постатей українського національного руху кінця XIX — початку XX століття. Вона підтримувала боротьбу за <b>незалежність України</b>, займалася педагогічною діяльністю, активно писала статті й публіцистичні твори. Вона багато подорожувала, проживала в різних країнах Європи, де знаходила підтримку серед культурної еліти. Леся Українка померла <b>1 серпня 1913 </b> в місті Сурамі (Грузія), залишивши по собі величезну спадщину. Її твори стали основою для розвитку сучасної української літератури та надихають наступні покоління.
            </p>
          </div>
        </div>
        <div className="author-actions">
          <p className="action-text1">Виконати тест</p>
          <p className="action-text2">Почути голос письменниці</p>
          <p className="action-text3">Цікаві факти</p>
        </div>
      </div>
     

      {/* Author 3 */}
      <div className="author-container">
        <h1>Іван Франко</h1>
        <div style={{ width: '80%', height: '5px', backgroundColor: '#37633f', marginLeft: '0px'}}></div>
        <div className="author-content">
          <img
            src="https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/%D0%86%D0%B2%D0%B0%D0%BD_%D0%AF%D0%BA%D0%BE%D0%B2%D0%B8%D1%87_%D0%A4%D1%80%D0%B0%D0%BD%D0%BA%D0%BE.jpg/250px-%D0%86%D0%B2%D0%B0%D0%BD_%D0%AF%D0%BA%D0%BE%D0%B2%D0%B8%D1%87_%D0%A4%D1%80%D0%B0%D0%BD%D0%BA%D0%BE.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
          <div className="author-text">
            <p>
            <b>Іван Якович Франко (1856–1916)</b> — один із найвідоміших українських письменників, поетів, публіцистів, філософів, вчених і політичних діячів. Франко народився <b>27 серпня 1856 року</b> в селі Нагуєвичі (тепер Львівська область) в родині селян. Він був багатогранною особистістю, яка зробила величезний внесок у розвиток української культури та літератури. Франко отримав гарну освіту, навчався в університетах <b>Львова та Відня</b>, де вивчав <b>філософію, філологію, історію та економіку</b>. Його інтелектуальні погляди значно вплинули на розвиток української національної думки.

Франко був одним із засновників <b>нової української літератури</b> та одним із найвідоміших представників літературного руху, який постав наприкінці XIX століття.
            </p>
          </div>
        </div>
        <div className="author-text2">
          <p>
          Він писав у різних жанрах: <b>поезії, прозі, драматургії, публіцистиці</b>. Його твори, зокрема поеми <b>"Іван Вишенський", "Мойсей", роман "Борислав сміється"</b> та численні статті, порушують важливі соціальні, національні та політичні питання. Франко зображував <b>боротьбу за права людини, соціальну справедливість, національне відродження та демократичні цінності</b>. Він був одним з перших, хто активно підтримував ідеї соціалізму, але з часом виявив критичне ставлення до радикальних форм цього руху.
          </p>


        </div>

        <div className="author-content">
        <div className="author-text">
            <p>
            Окрім літературної діяльності, Франко був і <b>активним громадським діячем, політиком і публіцистом</b>. Він активно виступав за розвиток української культури, за права українців в <b>Австро-Угорщині</b>, за освіту й розвиток національної свідомості. Франко був обраний депутатом до австрійського парламенту, де відстоював інтереси українців. Його життя було складним, сповненим боротьбою за ідеали та принципи, він часто стикався з переслідуваннями й <b>репресіями</b> з боку влади. Іван Франко помер <b>28 травня 1916 року</b> у Львові. Його творчість і діяльність залишили незгладимий слід в історії України, і він є одним із символів української національної ідентичності.
            </p>
          </div>
          <img
            src="https://www.ukrlib.com.ua/my/images/full/franko-ivan-iakovych_1.jpg" // Replace with actual image
            alt="Taras Shevchenko"
            className="author-photo"
          />
        </div>
        <div className="author-actions">
          <p className="action-text1">Виконати тест</p>
          <p className="action-text2">Почути голос письменника</p>
          <p className="action-text3">Цікаві факти</p>
        </div>

      </div>
     
    </>
  );
};

export default AboutAuthors;
