import React from 'react';
import Sidebar from './Sidebar';
import '../styles/AboutAuthors.css';

const AboutAuthors = () => {
  return (
    <div className="about-authors-page">
      <Sidebar />
      <div className="main-content">
        <h1>About Ukrainian Authors</h1>

        <div className="author-section1">
          <h2 className="author-name1">Taras Shevchenko</h2>
          <div className="content1">
            <img 
              className="author-image1"
              src={require('../images/taras1.jpg')} 
              alt="Taras Shevchenko"
            />
            <p className="author-info1">
              Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч, один з основоположників нової української літератури. Народився 9 березня 1814 року в селянській родині на Черкащині. У ранньому віці став сиротою і потрапив у кріпацтво до поміщика Енгельгардта, де пережив важкі роки. Однак завдяки своєму таланту, він здобув освіту у Петербурзі, ставши студентом Академії мистецтв. Шевченко був активним учасником громадського життя і членом Кирило-Мефодіївського братства, за що його арештували і заслали на каторгу до Оренбурга. Після повернення із заслання продовжував свою літературну і художню діяльність, хоча й був під наглядом влади. Його творчість охоплює поезію, прозу та живопис. Найвідоміші його твори — поетичні збірки "Кобзар" (1840), "Гайдамаки" (1841) та "Єретик" (1860). Шевченко став символом боротьби за національну ідентичність та свободу. Помер 10 березня 1861 року.
            </p>
          </div>
        </div>
        <div className="author-section2">
          <h3 className="author-name2">Taras Shevchenko</h3>
          <div className="content2">
          <p className="author-info2">
              Тарас Шевченко (1814–1861) — український поет, художник, громадський діяч, один з основоположників нової української літератури. Народився 9 березня 1814 року в селянській родині на Черкащині. У ранньому віці став сиротою і потрапив у кріпацтво до поміщика Енгельгардта, де пережив важкі роки. Однак завдяки своєму таланту, він здобув освіту у Петербурзі, ставши студентом Академії мистецтв. Шевченко був активним учасником громадського життя і членом Кирило-Мефодіївського братства, за що його арештували і заслали на каторгу до Оренбурга. Після повернення із заслання продовжував свою літературну і художню діяльність, хоча й був під наглядом влади. Його творчість охоплює поезію, прозу та живопис. Найвідоміші його твори — поетичні збірки "Кобзар" (1840), "Гайдамаки" (1841) та "Єретик" (1860). Шевченко став символом боротьби за національну ідентичність та свободу. Помер 10 березня 1861 року.
            </p>
            <img 
              className="author-image2"
              src={require('../images/taras1.jpg')}
              alt="Taras Shevchenko"
            />
            
          </div>
        </div>
      </div>
    </div>
  );
}

export default AboutAuthors;